Repository: 1Maxnet1/opbasm
Catalog: opbasm/lang/*/LC_MESSAGES/opbasm.po
Languages: de, fr

source: Unknown string:
de: Unbekannter String:
fr: Inconnu chaîne:

source: Unknown table:
de: Unbekannte Tabelle:
fr: Une table inconnue:

source: Input file
de: Eingabedatei
fr: Le fichier d'entrée

source: Module or entity name (defaults to input file name)
de: Modul oder Entity-Name (Standardwert entspricht Eingabedateinamen)
fr: Module ou le nom de l'entité (par défaut le nom du fichier d'entrée)

source: Template file
de: Vorlagendatei
fr: Modèle de fichier

source: Assemble PicoBlaze-6 code
de: Übersetze PicoBlaze-6-Code
fr: Assemblez PicoBlaze-6 code

source: Assemble PicoBlaze-3 code
de: Übersetze PicoBlaze-3-Code
fr: Assemblez PicoBlaze-3 code

source: Program memory size
de: Programmspeichergröße
fr: Taille de la mémoire de programme

source: Scratchpad memory size
de: Scratchpad-Speichergröße
fr: Taille de la mémoire de scratchpad

source: Write HEX in place of MEM file
de: Schreibe HEX- anstatt der MEM-Datei
fr: Ecrire HEX à la place du fichier MEM

source: Write MIF in place of MEM file
de: Schreibe HEX- anstatt der MEM-Datei
fr: Ecrire HEX à la place du fichier MEM

source: Output directory
de: Ausgabeverzeichnis
fr: Répertoire de sortie

source: Optimization level
de: Optimierungen
fr: Niveau d'optimisation

source: Perform dead code analysis shown in log file
de: Führe Unerreichbarkeitsanalyse aus (Ausgabe in der Protokolldatei)
fr: Effectuez analyse de code mort montré dans le fichier journal

source: Remove dead code from assembled source
de: Entferne toten Code aus übersetzter Quelle
fr: Retirer code mort de la source assemblé

source: Set address of ISR (or other) entry point
de: Lege (ISR-)Einsprungadresse fest
fr: Réglez l'adresse du ISR (ou autre) point d'entrée

source: Colorize log file
de: Protokolldatei einfärben
fr: Coloriser fichier journal

source: Set number of columns for reflines in log
de: Legen Sie die Anzahl der Spalten für die Refline im Protokoll fest
fr: Définir le nombre de colonnes pour les reflines dans le journal

source: Render reflines with ASCII-only characters
de: Render Reflines mit ASCII-Zeichen
fr: Rendre les reflines avec les caractères ASCII-only

source: Get default template files
de: Kopiere Standardvorlagendateien
fr: Obtenez les fichiers de modèle par défaut

source: Show OPBASM version
de: Zeige OPBASM Version
fr: Afficher la version OPBASM

source: Quiet output
de: Stille Ausgabe
fr: Calme sortie

source: Verbose output
de: Stille Ausgabe
fr: Sortie verbale

source: Use m4 preprocessor on all source files
de: Wende den m4 Präprozessor auf alle Quelldateien an
fr: Utilisez m4 préprocesseur sur tous les fichiers source

source: Define m4 macro NAME as having VALUE or empty
de: Definiere m4 Macro NAME mit dem Wert VALUE oder nichts.
fr: Définir macro m4 NAME comme ayant une VALUE ou vide

source: Transformed source file after initial preprocessing
de: Transformierte Quelldatei nach der ersten Vorverarbeitung
fr: Fichier source transformé après prétraitement initiale

source: OPBASM version
fr: Version OPBASM

source: Missing input file
de: Fehlende Eingabedatei
fr: Fichier d'entrée manquant

source: Cannot select both PicoBlaze architectures
de: Es können nicht beide PicoBlaze Architekturen auswählt werden
fr: Vous ne pouvez pas sélectionner les deux architectures PicoBlaze

source: Invalid scratchpad size
de: Ungültige Scratchpad-Größe
fr: Taille de le scratchpad non valide

source: Memory size is too large
de: Die Speichergröße ist zu groß
fr: Taille de la mémoire est trop grand

source: Invalid entry point address
de: Ungültiger Einsprungpunkt
fr: Adresse invalide du point d'entrée

source: Given template file '{}' does not exist.
de: Die angegebene Vorlagendatei '{}' existiert nicht.
fr: Ne existe pas donné fichier modèle '{}'.

source: ERROR:
de: FEHLER:
fr: ERREUR:

source: OPBASM - Open PicoBlaze Assembler {}
fr: OPBASM - Ouvrir PicoBlaze Assembleur {}

source: en
de: de
fr: fr

source: Translation for <this language> is machine generated. You can improve it by editing the message catalogs. See CONTRIBUTING for more info.
de: Not needed for German translation
fr: Traduction pour le français est générée par la machine. Vous pouvez l'améliorer en modifiant les catalogues de messages. Voir CONTRIBUTING pour plus d'info.

source: WARNING: PicoBlaze-6 will become the default target in version 1.4. Convert any PicoBlaze-3 projects to use the -3 option.
de: ACHTUNG: PicoBlaze-6 wird ab Version 1.4 zum Standard-Target werden. Passen Sie alle PicoBlaze-3 Projekte an, sodass die Assembleroption -3 benutzt wird.
fr: AVERTISSEMENT: PicoBlaze-6 va devenir la cible par défaut dans la version 1.4. Convertir les PicoBlaze-3 projets d'utiliser l'option -3.

source: Module name must be provided when reading from stdin (use -n <name>)
de: Der Modulename muss angegeben werden, wenn von STDIN gelesen wird (Option: -n <Modulname>)
fr: Nom du module doit être fournie lors de la lecture de stdin (utilisation -n <nom>)

source: Input file not found
de: Eingabedatei nicht gefunden
fr: Le fichier d'entrée introuvable

source: Target architecture:
de: Zielarchitektur:
fr: Architecture cible:

source: Device configuration: Memory size: {}, Scratchpad size: {}
de: Gerätekonfiguration: Speichergröße: {}, Scratchpad-Größe: {}
fr: Configuration de l'appareil: Taille de la mémoire: {}, Taille de le scratchpad: {}

source: {} instructions out of {} ({}%)
de: {} Befehle von {} ({}%)
fr: {} Instructions sur {} ({}%)

source: Highest occupied address: {:03X} hex
de: Höchste benutzte Adresse: {:03X} hex
fr: Adresse la plus élevée occupée: {:03X} hex

source: Found {}:
de: Gefunden {}:
fr: Trouvé {}:

source: templates
de: Vorlagen
fr: modèles

source: template
de: Vorlage
fr: modèle

source: Writing output
de: Schreibe Ausgaben:
fr: Sortie rédaction

source: preprocessor:
de: Präprozessor:
fr: préprocesseur:

source: log file:
de: Protokolldatei:
fr: fichier journal:

source: {} line {} (expanded line {})
de: {} Zeile {} (Expandierte Zeile {})
fr: {} ligne {} (ligne élargie {})

source: {} line {}
de: {} Zeile {}
fr: {} ligne {}

source: Bad statement in {}: {}
de: Fehlerhafte Anweisung in Zeile {}: {}
fr: Mauvaise déclaration dans {}: {}

source: No m4 macro directory found
de: Kein m4 Makro-Verzeichnis gefunden
fr: Aucun répertoire macro m4 trouvé

source: m4 failure on file {}
de: m4 Verarbeitungsfehler {}
fr: m4 échec dans le fichier {}

source: Redefinition of label:
de: Neudefinition des Labels:
fr: Redéfinition de l'étiquette:

source: Include file not found:
de: Include-Datei nicht gefunden:
fr: Inclure fichier non trouvé:

source: Invalid include parameter
de: Ungültiger Include-Parameter
fr: Invalid paramètre inclure

source: Missing argument to constant directive
de: Fehlendes Argument in der CONSTANT-Direktive
fr: Manquant argument pour la directive constante

source: Redefinition of constant:
de: Neudefinition der Konstante:
fr: Redéfinition de la constante:

source: Invalid constant. Conflicts with hex literal
de: Ungültiger Konstantenname. Konflikt mit dem hex-Literal
fr: Constantes invalides. Conflits avec littérale hex

source: Unknown environment variable:
de: Unbekannte Umgebungsvariable:
fr: Inconnu variable d'environnement:

source: Missing argument to STRING directive
de: Fehlendes Argument in der STRING-Direktive
fr: Argument pour la directive de STRING manquante

source: Invalid string name (missing $):
de: Ungültiger String-Name (fehlendes $):
fr: Invalide nom de chaîne (manquant de $):

source: Redefinition of string:
de: Neudefinition des Strings:
fr: Redéfinition de la chaîne:

source: Not a valid string:
de: Kein gültiger String:
fr: Pas une chaîne valide:

source: Missing argument to TABLE directive
de: Fehlendes Argument in der TABLE-Direktive
fr: Argument pour la directive de TABLE manquante

source: Invalid table name (missing #):
de: Ungültiger Tabellenname (fehlendes #):
fr: Non valide nom de la table (manque de #):

source: Redefinition of table:
de: Neudefinition der Tabelle:
fr: Redéfinition de la table:

source: Missing table definition
de: Fehlende Tabellendefinition
fr: Définition de la table manquante

source: Invalid table element (radix {})
de: Ungültiges Tabellenelement (Radix {})
fr: Élément de table invalide (radix {})

source: Table value out of range:
de: Tabellenwert außerhalb des Wertebereichs:
fr: Valeur de tableau hors de portée:

source: Recursive include:
de: Rekursives einbinden:
fr: Inclure récursive:

source: Label not found "{}". Possibly removed.
de: Label Sie nicht gefunden "{}". Möglicherweise entfernt.
fr: Étiqueter introuvable "{}". Peut-être supprimée.

source: Address exceeds memory bounds: {:03X} (limit {:03X})
de: Adresse übersteigt Speichergrenze: {:03X} (Grenze {:03X})
fr: Adresse dépasse les limites de mémoire: {:03X} (limite {:03X))

source: Invalid address:
de: Ungültige Adresse:
fr: Adresse non valide:

source: Missing address
de: Fehlende Adresse
fr: Adresse manquant

source: Out of range address
de: Ungültige Adresse
fr: Sur adresse de gamme

source: Missing operand
de: Fehlender Operand
fr: Opérande manquant

source: Illegal operand:
de: Unzulässiger Operand:
fr: Opérande illégal:

source: Invalid register:
de: Ungültiges Register:
fr: Registre non valide:

source: Label has been removed: {} Add ";PRAGMA keep [on,off]" to preserve this label
de: Label wurde entfernt: {} Ein ";PRAGMA keep [on,off]" Bereich bewart das Label.
fr: Étiquette a été supprimé: {} Ajouter ";PRAGMA keep [on,off]" pour préserver cette étiquette

source: Unknown label:
de: Unbekanntes Label:
fr: Une étiquette inconnue:

source: Invalid operand:
de: Ungültiger Operand:
fr: Opérande non valide:

source: Immediate value out of range:
de: Immediate Wert außerhalb des Wertebereichs:
fr: Valeur immédiate hors de portée:

source: Scratchpad address out of range:
de: Scratchpad-Adresse außerhalb des Adressbereichs:
fr: Adresse scratchpad hors de portée:

source: Invalid operand to {}
de: Ungültige Operanden für {}
fr: Opérande non valide à {}

source: Invalid operand to RETURNI
de: Ungültige Operanden in RETURNI
fr: Opérande non valide à RETURNI

source: Invalid port for OUTPUTK <value>, <port>: {} Port must range from 0 to F
de: Ungültiger Port für OUTPUTK <value>, <port>: {} Port muss im Bereich 0x0 bis 0xF liegen.
fr: Port non valide pour OUTPUTK <value>, <port>: {} Port doit aller de 0 à F

source: Invalid operand to REGBANK
de: Ungültiger Operand in REGBANK-Befehl
fr: Opérande non valide à REGBANK

source: Invalid INST value:
de: Ungültiger Wert für INST-Befehl:
fr: INST valeur non valide:

source: Unknown instruction:
de: Unbekannter Befehl:
fr: Inconnu instruction:

source: Missing argument to NAMEREG directive
de: Fehlendes Argument in NAMEREG-Direktive
fr: Manquant argument pour la directive NAMEREG

source: Unknown register name:
de: Unbekannter Registername:
fr: Inconnu nom de registre:

source: Redefinition of default jump
de: Neudefinition der Standard-Sprungmarke
fr: Redéfinition de saut par défaut

source: Too many arguments to DEFAULT_JUMP
de: Zu viele Argumente für DEFAULT_JUMP
fr: Trop d'arguments pour DEFAULT_JUMP

source: Reading source:
de: Lese Quelle:
fr: Lire la source:

source: Assembling code...
de: Übersetze Code...
fr: Code Montage...

source: Beginning optimizations...
de: beginnend Optimierungen...
fr: Début optimisations...

source: Two instructions are assigned to address {:03X} First: {} Second: {}
de: Zwei Anweisungen belegen die selbe Adresse {:03X} Erste: {} Zweite: {}
fr: Deux instructions sont assignées aux {:03X} Premier: {} Deuxièmement: {}

source: SUCCESS
de: ERFOLGREICH
fr: SUCCÈS

source: Open PicoBlaze Assembler log for program "{}"
de: Öffne PicoBlaze Assembler-Protokoll für Programm "{}"
fr: Le journal de l'Assembleur de PicoBlaze Ouverte pour le programme "{}"

source: Generated by opbasm v{}
de: Von opbasm v{} erzeugt
fr: Généré par opbasm v{}

source: Assembled on {}
de: Übersetzt auf {}
fr: Monté sur {}

source: Target architecture: {}
de: Zielarchitektur: {}
fr: Architecture cible: {}

source: Last occupied address: {:03X} hex
de: Letzte benutzte Adresse: {:03X} hex
fr: Dernière adresse occupée: {:03X} hex

source: Nominal program memory size: {}K ({}) address({}:0)
de: Nennprogrammspeichergröße: {}K ({}) Adresse({}:0)
fr: Nominale taille de la mémoire du programme: {}K ({}) adresse({}:0)

source: Actual memory size:
de: Tatsächliche Speichergröße:
fr: La taille réelle de la mémoire:

source: Occupied memory locations:
de: Belegte Speicherplätze:
fr: Emplacements de mémoire occupés:

source: Memory locations available:
de: Verfügbare Speicherplätze:
fr: Les emplacements mémoire disponibles:

source: Scratchpad size:
de: Scratchpad-Größe:
fr: Taille de le Scratchpad:

source: Optimizations
de: Optimierungen
fr: Optimisations

source: Assembly listing
de: Assembler-Listing
fr: Listing assemblée

source: All unused memory locations contain zero (equivalent to "{}")
de: Alle ungenutzen Speicherbereiche enthalten Nullen (equivalent zu "{}")
fr: Tous les emplacements de mémoire inutilisés contiennent zéro (équivalent à "{}")

source: All unused memory locations contain a DEFAULT_JUMP to {:03X}
de: Alle ungenutzen Speicherbereiche enthalten den DEFAULT_JUMP zu {:03X}
fr: Tous les emplacements de mémoire inutilisés contiennent une DEFAULT_JUMP à {: 03X}

source: PSM files that have been assembled
de: PSM-Dateien, die verarbeitet worden
fr: PSM fichiers qui ont été assemblés

source: List of defined constants
de: Liste der definierten Konstanten
fr: Liste des constantes définies

source: CONSTANT name
fr: Nom CONSTANT

source: Value
de: Wert
fr: Valeur

source: Source PSM file
de: PSM-Quelldatei
fr: Fichier PSM source

source: * Unreferenced constant(s)
de: * Unreferenzierte Konstante(n)
fr: * Constante(s) non référencé(s)

source: No tables defined
de: Keine Tabellen definiert
fr: Pas de tables définis

source: List of defined tables
de: Liste der definierten Tabellen
fr: Liste des tables définies

source: TABLE name
fr: Nom TABLE

source: * Unreferenced table(s)
de: * Unreferenzierte Table(n)
fr: * Table(s) non référencé(s)

source: List of text strings
de: Liste der Strings
fr: Liste des chaînes de texte

source: STRING name
fr: Nom STRING

source: * Unreferenced string(s)
de: * Unreferenzierte String(s)
fr: * String non référencé(s)

source: List of line labels
de: Liste der Labels
fr: Liste des étiquettes de ligne

source: Label
fr: Etiquette

source: Addr
de: Adr
fr: Adr

source: * Unreferenced label(s)
de: * Nicht referenzierte Label(s)
fr: * Étiquette non référencé(s)

source: List of pragma blocks
de: Liste der Pragma-Blöcke
fr: Liste des blocs de pragma

source: Name
fr: Nom

source: Addr range
de: Adressbereich
fr: Gamme de Adr

source: Instruction usage statistics
de: Befehlsnutzungsstatistiken
fr: Les statistiques d'utilisation de l'instruction

source: Unknown template data format
de: Unknown Vorlage Dateiformat
fr: Format de données de gabarits Inconnu

source: VHDL file:
de: VHDL-Datei:
fr: fichier VHDL:

source: Verilog file:
de: Verilog-Datei:
fr: fichier Verilog:

source: WARNING:
de: WARNUNG:
fr: AVERTISSEMENT:

source: Unmapped INIT fields found in template
de: Unzugeordnete INIT-Felder in der template-Datei gefunden.
fr: INIT champs non mappées trouvés dans le modèle

source: Formatted source:
de: Formatierter Quelltext:
fr: La source formaté:

source: Unrecognized pragma at {}
de: Unbekanntes PRAGMA an {}
fr: Pragma non reconnu dans le fichier {}

source: Cannot determine template data format
de: Kann nicht feststellen, Vorlage Dateiformat
fr: Impossible de déterminer le format de données de modèle

source: Retrieving default templates...
de: Abrufen der Standardvorlagen...
fr: Récupération des modèles par défaut...

source: No template directory found
de: Kein Template-Verzeichnis gefunden
fr: Aucun répertoire de modèle trouvé

source: COPYING:
de: KOPIEREN:
fr: COPIE:

source: Static analysis: searching for dead code...
de: Statische Analyse: Suche nach unerreichbarem Code...
fr: Analyse statique: la recherche de code mort...

source: COMPLETE
de: VOLLSTÄNDIG
fr: COMPLET

source: Entry points:
de: Einstiegspunkte:
fr: Les points d'entrée:

source: {} dead instructions found
de: {} unerreichbare Anweisungen gefunden
fr: {} Instructions morts trouvés

source: Static analysis: Dead instructions {}: {}
de: Statische Analyse: Unerreichbare Anweisungen {}: {}
fr: L'analyse statique: Instructions morts {}: {}

source: found
de: gefunden
fr: trouvé

source: Analyzed entry points:
de: Analysierte Einsprungpunkte:
fr: Points d'entrée analysés:

source: Dead code removal:
de: Dead Code Entfernung:
fr: Suppression du code mort:

source: Applied
de: Angewandt
fr: Appliqué

source: None
de: Keiner
fr: Aucun

source: Dead code removal: {}
de: Dead Code Entfernung: {}
fr: Suppression du code mort: {}

source: mem map:
de: Speicherauszug:

source: REMOVED
de: ENTFERNT

source: Invalid {} instruction:
de: Ungültiger {} Befehl:

source: Instruction
de: Befehle

source: Instances
de: Instanzen
